app/views/users/index.html.erb


<% @users = User.all %>
<% @tasks = Task.all%>
---
SELECT "users".* FROM "users"
SELECT "tasks".* FROM "tasks"