app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "due_date", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Home Page"], ["due_date", "2022-09-10"], ["description", "Create a home page"], ["created_at", "2022-09-01 08:35:44.351656"], ["updated_at", "2022-09-01 08:35:44.351656"], ["user_id", 4]]
---
  def create
    #@task = Task.new(task_params)
    @task = current_user.tasks.build(task_params)
    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "abc go"], ["updated_at", "2022-09-12 05:21:19.817823"], ["id", 37]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 9], ["LIMIT", 1]]
---
  def correct_user
      @task = current_user.tasks.find_by(id: params[:id])